app/controllers/admin/articles_controller.rb

SELECT `categories`.* FROM `categories`
---
  def new
    @categories = Category.all

INSERT INTO `articles` (`user_id`, `category_id`, `title`, `description`, `status`, `picture`, `created_at`, `updated_at`) VALUES (1, 1, 'Noticia', 'teste', 1, 'tse', '2016-10-23 14:37:58', '2016-10-23 14:37:58')
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    respond_to do |format|
      if @article.save

UPDATE `articles` SET `picture` = 'WhatsApp_Image_2016-10-18_at_10.17.22__1_.jpeg', `updated_at` = '2016-10-26 00:35:48' WHERE `articles`.`id` = 3
---
  def update
    respond_to do |format|
      if @article.update(article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 1
---
  def destroy
    @article.destroy

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
    def set_article
      @article = Article.find(params[:id])