app/controllers/admin/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `status`, `created_at`, `updated_at`) VALUES ('Teste', 1, '2016-10-23 14:37:31', '2016-10-23 14:37:31')

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE `categories` SET `name` = 'Radiologia', `updated_at` = '2016-10-23 14:37:40' WHERE `categories`.`id` = 1

  def destroy
    @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 2

    def set_category
      @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1