app/controllers/admin/clinics_controller.rb

  def index
    @clinics = Clinic.all
---
SELECT `clinics`.* FROM `clinics`

  def create
    @clinic = Clinic.new(clinic_params)

    respond_to do |format|
      if @clinic.save
---
INSERT INTO `clinics` (`name`, `title`, `description`, `status`, `photos`, `created_at`, `updated_at`) VALUES ('tsete', 'stets', 'etsetst', 1, '\"tsteset\"', '2016-10-23 14:22:27', '2016-10-23 14:22:27')

  def update
    respond_to do |format|
      if @clinic.update(clinic_params)
---
UPDATE `clinics` SET `photos` = '\"asdasdtsteset\"', `updated_at` = '2016-10-23 14:22:34' WHERE `clinics`.`id` = 1

  def destroy
    @clinic.destroy
---
DELETE FROM `clinics` WHERE `clinics`.`id` = 2

    def set_clinic
      @clinic = Clinic.find(params[:id])
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 2 LIMIT 1