app/controllers/admin/features_controller.rb

SELECT `features`.* FROM `features`
---
  def index
    @features = Feature.all

INSERT INTO `features` (`title`, `description`, `photo`, `textlink`, `link`, `status`, `created_at`, `updated_at`) VALUES ('teste', 'tsete', 'tsete', 'teste', 'tsets', 1, '2016-10-23 13:49:29', '2016-10-23 13:49:29')
---
  def create
    @feature = Feature.new(feature_params)

    respond_to do |format|
      if @feature.save

UPDATE `features` SET `photo` = 'Logo_RaphaLeo_FINAL_2.png', `updated_at` = '2016-10-23 20:19:30' WHERE `features`.`id` = 1
---
  def update
    respond_to do |format|
      if @feature.update(feature_params)

DELETE FROM `features` WHERE `features`.`id` = 2
---
  def destroy
    @feature.destroy

SELECT  `features`.* FROM `features` WHERE `features`.`id` = 2 LIMIT 1
---
    def set_feature
      @feature = Feature.find(params[:id])