app/controllers/admin/services_controller.rb

  def index
    @services = Service.all
---
SELECT `services`.* FROM `services`

  def create
    @service = Service.new(service_params)

    respond_to do |format|
      if @service.save
---
INSERT INTO `services` (`title`, `description`, `image`, `status`, `created_at`, `updated_at`) VALUES ('teste', 'testse', 'tsets', 1, '2016-10-23 13:57:23', '2016-10-23 13:57:23')

  def update
    respond_to do |format|
      if @service.update(service_params)
---
UPDATE `services` SET `image` = 'WhatsApp_Image_2016-10-18_at_10.17.17.jpeg', `updated_at` = '2016-10-26 01:49:51' WHERE `services`.`id` = 2

  def destroy
    @service.destroy
---
DELETE FROM `services` WHERE `services`.`id` = 1

    def set_service
      @service = Service.find(params[:id])
---
SELECT  `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1