app/controllers/admin/testemonials_controller.rb

  def index
    @testemonials = Testemonial.all
---
SELECT `testemonials`.* FROM `testemonials`

  def create
    @testemonial = Testemonial.new(testemonial_params)

    respond_to do |format|
      if @testemonial.save
---
INSERT INTO `testemonials` (`name`, `organization`, `description`, `avatar`, `status`, `created_at`, `updated_at`) VALUES ('gsgs', 'dfsfd', 'sdfsd', 'sdfsdf', 1, '2016-10-23 14:03:00', '2016-10-23 14:03:00')

  def update
    respond_to do |format|
      if @testemonial.update(testemonial_params)
---
UPDATE `testemonials` SET `avatar` = 'AAEAAQAAAAAAAAfJAAAAJDU3MGM3MDE2LTBjM2UtNDc3Ni04MzkyLTgyMWM2YWNjNzIwNQ.jpg', `updated_at` = '2016-10-26 01:36:21' WHERE `testemonials`.`id` = 3

  def destroy
    @testemonial.destroy
---
DELETE FROM `testemonials` WHERE `testemonials`.`id` = 2

    def set_testemonial
      @testemonial = Testemonial.find(params[:id])
---
SELECT  `testemonials`.* FROM `testemonials` WHERE `testemonials`.`id` = 2 LIMIT 1