app/controllers/admin/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('admin@demo.com.br', '$2a$11$8zDPTQ3Wa780JtZXvZQfHeiJ14CDX4stwMawnWxmQ8NqxBHBKNGEm', '2016-10-23 15:33:47', '2016-10-23 15:33:47')