app/views/admin/articles/_form.html.erb

    <%= f.label :category_id %>
    <%= collection_select(:article, :category_id, Category.all, :id, :name, {:prompt => 'Selecione uma Categoria...'}, {:class=>'form-control'})%>
---
SELECT `categories`.* FROM `categories`