app/controllers/home_controller.rb

SELECT `features`.* FROM `features`
SELECT `services`.* FROM `services`
SELECT `testemonials`.* FROM `testemonials`
SELECT `articles`.* FROM `articles`
---
  def index
    @features = Feature.all
    @services = Service.all
    @testemonials = Testemonial.all
    @news = Article.all

SELECT `testemonials`.* FROM `testemonials`
---
  def about
    @testemonials = Testemonial.all

SELECT `services`.* FROM `services`
---
  def services
    @services = Service.all